require('dotenv').config();
const { Telegraf, Markup } = require('telegraf');
const bot = new Telegraf(process.env.Bot_token, {
    telegram: {
      // Polling options
      agent: null,
      webhookReply: true,
      polling: {
        interval: 3000,  // Set polling interval to 3 seconds
        autoStart: true,
        params: {
          timeout: 10,
        },
      },
    },
  });

// commands
bot.start((ctx) => {
  ctx.reply(`Вітаю ${ctx.from.first_name}! Цей бот допоможе тобі розібратись з нашим вебінаром, тут будуть всі інструкції по цьому, і також будуть нагадування про початок вебінару.`, Markup.inlineKeyboard([
    Markup.button.callback('Більше про Ярослава', 'about'),
    Markup.button.callback('План вебінару', 'plan'),
  ]));
});
bot.action('about', (ctx) => {
  ctx.replyWithPhoto({ source: './img/about-img.png' }, {
    caption: "Привіт мене звати Ярослав Галенза. І так, у цій темі я вже понад 3 роки, встиг зібрати невелику команду. На сьогоднішній день МИ успішно інвестуємо в проекти пов’язані з криптою: IDO, ICO, NFT, METAVERSE… Я працював понад 2 роки з різними людьми в сфері фінансових ринків, які вже мали бізнес і реінвестували гроші в цю сферу! Простота цих  великих і успішних людей давала мені мотивацію, це і призвело мене до глобального мислення за рахунок якісного середовища навколо себе",
    reply_markup: {
      inline_keyboard: [
        [
          {
            text: "Instagram",
            url: "https://www.instagram.com/yaroslav_halenza/"
          },
        ]
      ]
    },
  });
  setTimeout(() => {
    ctx.sendMessage('Повідомлення яке буде через 5 секунд')
  }, 5000)
});
bot.action('plan', (ctx) => {
  ctx.reply('Приємно бачити ваш інтерес до цієї сфери! Ці теми останнім часом стають все більш популярними, і це не дарма. Криптовалюти пропонують нові захоплюючі можливості для інвестицій і торгівлі, але вони також вимагають унікального набору навичок і знань для ефективної навігації. На цьому вебінарі ми розглянемо деякі ключові принципи торгівлі криптовалютами, а також кілька практичних порад щодо початку роботи.')
  setTimeout(() => {
    ctx.reply(`🔥Під час вебінару ми розглянемо основи криптовалюти та трейдингу, зокрема, як купувати та продавати криптовалюту, як читати діаграми та аналізувати ринкові тенденції, як розробити власну торгову стратегію. Ми також обговоримо ризики та переваги торгівлі, а також деякі поширені помилки, яких слід уникати. До кінця вебінару ви матимете чітке розуміння ринку криптовалют та інструментів, які вам знадобляться, щоб впевнено почати торгувати.`);
  }, 1000)
});

// action


// launch
bot.launch();
